RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/emac_regs.h
  volatile uint32_t screening_type_2_register_0;  /*      0x540 - 0x544      */
  volatile uint32_t screening_type_2_register_1;  /*      0x544 - 0x548      */
  volatile uint32_t screening_type_2_register_2;  /*      0x548 - 0x54c      */
  volatile uint32_t screening_type_2_register_3;  /*      0x54c - 0x550      */
  volatile uint32_t screening_type_2_register_4;  /*      0x550 - 0x554      */
  volatile uint32_t screening_type_2_register_5;  /*      0x554 - 0x558      */
  volatile uint32_t screening_type_2_register_6;  /*      0x558 - 0x55c      */
  volatile uint32_t screening_type_2_register_7;  /*      0x55c - 0x560      */
  volatile uint32_t screening_type_2_register_8;  /*      0x560 - 0x564      */
  volatile uint32_t screening_type_2_register_9;  /*      0x564 - 0x568      */
  volatile uint32_t screening_type_2_register_10; /*      0x568 - 0x56c      */
  volatile uint32_t screening_type_2_register_11; /*      0x56c - 0x570      */
  volatile uint32_t screening_type_2_register_12; /*      0x570 - 0x574      */
  volatile uint32_t screening_type_2_register_13; /*      0x574 - 0x578      */
  volatile uint32_t screening_type_2_register_14; /*      0x578 - 0x57c      */
  volatile uint32_t screening_type_2_register_15; /*      0x57c - 0x580      */
  volatile uint32_t tx_sched_ctrl;                /*      0x580 - 0x584      */
  volatile char pad__12[0xc];                     /*      0x584 - 0x590      */
  volatile uint32_t bw_rate_limit_q0to3;          /*      0x590 - 0x594      */
  volatile uint32_t bw_rate_limit_q4to7;          /*      0x594 - 0x598      */
  volatile uint32_t bw_rate_limit_q8to11;         /*      0x598 - 0x59c      */
  volatile uint32_t bw_rate_limit_q12to15;        /*      0x59c - 0x5a0      */
  volatile uint32_t tx_q_seg_alloc_q0to7;         /*      0x5a0 - 0x5a4      */
  volatile uint32_t tx_q_seg_alloc_q8to15;        /*      0x5a4 - 0x5a8      */
  volatile char pad__13[0x18];                    /*      0x5a8 - 0x5c0      */
  volatile uint32_t receive_q8_ptr;               /*      0x5c0 - 0x5c4      */
  volatile uint32_t receive_q9_ptr;               /*      0x5c4 - 0x5c8      */
  volatile uint32_t receive_q10_ptr;              /*      0x5c8 - 0x5cc      */
  volatile uint32_t receive_q11_ptr;              /*      0x5cc - 0x5d0      */
  volatile uint32_t receive_q12_ptr;              /*      0x5d0 - 0x5d4      */
  volatile uint32_t receive_q13_ptr;              /*      0x5d4 - 0x5d8      */
  volatile uint32_t receive_q14_ptr;              /*      0x5d8 - 0x5dc      */
  volatile uint32_t receive_q15_ptr;              /*      0x5dc - 0x5e0      */
  volatile uint32_t dma_rxbuf_size_q8;            /*      0x5e0 - 0x5e4      */
  volatile uint32_t dma_rxbuf_size_q9;            /*      0x5e4 - 0x5e8      */
  volatile uint32_t dma_rxbuf_size_q10;           /*      0x5e8 - 0x5ec      */
  volatile uint32_t dma_rxbuf_size_q11;           /*      0x5ec - 0x5f0      */
  volatile uint32_t dma_rxbuf_size_q12;           /*      0x5f0 - 0x5f4      */
  volatile uint32_t dma_rxbuf_size_q13;           /*      0x5f4 - 0x5f8      */
  volatile uint32_t dma_rxbuf_size_q14;           /*      0x5f8 - 0x5fc      */
  volatile uint32_t dma_rxbuf_size_q15;           /*      0x5fc - 0x600      */
  volatile uint32_t int_q1_enable;                /*      0x600 - 0x604      */
  volatile uint32_t int_q2_enable;                /*      0x604 - 0x608      */
  volatile uint32_t int_q3_enable;                /*      0x608 - 0x60c      */
  volatile uint32_t int_q4_enable;                /*      0x60c - 0x610      */
  volatile uint32_t int_q5_enable;                /*      0x610 - 0x614      */
  volatile uint32_t int_q6_enable;                /*      0x614 - 0x618      */
  volatile uint32_t int_q7_enable;                /*      0x618 - 0x61c      */
  volatile char pad__14[0x4];                     /*      0x61c - 0x620      */
  volatile uint32_t int_q1_disable;               /*      0x620 - 0x624      */
  volatile uint32_t int_q2_disable;               /*      0x624 - 0x628      */
  volatile uint32_t int_q3_disable;               /*      0x628 - 0x62c      */
  volatile uint32_t int_q4_disable;               /*      0x62c - 0x630      */
  volatile uint32_t int_q5_disable;               /*      0x630 - 0x634      */
  volatile uint32_t int_q6_disable;               /*      0x634 - 0x638      */
  volatile uint32_t int_q7_disable;               /*      0x638 - 0x63c      */
  volatile char pad__15[0x4];                     /*      0x63c - 0x640      */
  volatile uint32_t int_q1_mask;                  /*      0x640 - 0x644      */
  volatile uint32_t int_q2_mask;                  /*      0x644 - 0x648      */
  volatile uint32_t int_q3_mask;                  /*      0x648 - 0x64c      */
  volatile uint32_t int_q4_mask;                  /*      0x64c - 0x650      */
  volatile uint32_t int_q5_mask;                  /*      0x650 - 0x654      */
  volatile uint32_t int_q6_mask;                  /*      0x654 - 0x658      */
  volatile uint32_t int_q7_mask;                  /*      0x658 - 0x65c      */
  volatile char pad__16[0x4];                     /*      0x65c - 0x660      */
  volatile uint32_t int_q8_enable;                /*      0x660 - 0x664      */
  volatile uint32_t int_q9_enable;                /*      0x664 - 0x668      */
  volatile uint32_t int_q10_enable;               /*      0x668 - 0x66c      */
  volatile uint32_t int_q11_enable;               /*      0x66c - 0x670      */
  volatile uint32_t int_q12_enable;               /*      0x670 - 0x674      */
  volatile uint32_t int_q13_enable;               /*      0x674 - 0x678      */
  volatile uint32_t int_q14_enable;               /*      0x678 - 0x67c      */
  volatile uint32_t int_q15_enable;               /*      0x67c - 0x680      */
  volatile uint32_t int_q8_disable;               /*      0x680 - 0x684      */
  volatile uint32_t int_q9_disable;               /*      0x684 - 0x688      */
  volatile uint32_t int_q10_disable;              /*      0x688 - 0x68c      */
  volatile uint32_t int_q11_disable;              /*      0x68c - 0x690      */
  volatile uint32_t int_q12_disable;              /*      0x690 - 0x694      */
  volatile uint32_t int_q13_disable;              /*      0x694 - 0x698      */
  volatile uint32_t int_q14_disable;              /*      0x698 - 0x69c      */
  volatile uint32_t int_q15_disable;              /*      0x69c - 0x6a0      */
  volatile uint32_t int_q8_mask;                  /*      0x6a0 - 0x6a4      */
  volatile uint32_t int_q9_mask;                  /*      0x6a4 - 0x6a8      */
  volatile uint32_t int_q10_mask;                 /*      0x6a8 - 0x6ac      */
  volatile uint32_t int_q11_mask;                 /*      0x6ac - 0x6b0      */
  volatile uint32_t int_q12_mask;                 /*      0x6b0 - 0x6b4      */
  volatile uint32_t int_q13_mask;                 /*      0x6b4 - 0x6b8      */
  volatile uint32_t int_q14_mask;                 /*      0x6b8 - 0x6bc      */
  volatile uint32_t int_q15_mask;                 /*      0x6bc - 0x6c0      */
  volatile char pad__17[0x20];                    /*      0x6c0 - 0x6e0      */
  volatile uint32_t screening_type_2_ethertype_reg_0;
                                                  /*      0x6e0 - 0x6e4      */
  volatile uint32_t screening_type_2_ethertype_reg_1;
                                                  /*      0x6e4 - 0x6e8      */
  volatile uint32_t screening_type_2_ethertype_reg_2;
                                                  /*      0x6e8 - 0x6ec      */
  volatile uint32_t screening_type_2_ethertype_reg_3;
                                                  /*      0x6ec - 0x6f0      */
  volatile uint32_t screening_type_2_ethertype_reg_4;
                                                  /*      0x6f0 - 0x6f4      */
  volatile uint32_t screening_type_2_ethertype_reg_5;
                                                  /*      0x6f4 - 0x6f8      */
  volatile uint32_t screening_type_2_ethertype_reg_6;
                                                  /*      0x6f8 - 0x6fc      */
  volatile uint32_t screening_type_2_ethertype_reg_7;
                                                  /*      0x6fc - 0x700      */
  volatile uint32_t type2_compare_0_word_0;       /*      0x700 - 0x704      */
  volatile uint32_t type2_compare_0_word_1;       /*      0x704 - 0x708      */
  volatile uint32_t type2_compare_1_word_0;       /*      0x708 - 0x70c      */
  volatile uint32_t type2_compare_1_word_1;       /*      0x70c - 0x710      */
  volatile uint32_t type2_compare_2_word_0;       /*      0x710 - 0x714      */
  volatile uint32_t type2_compare_2_word_1;       /*      0x714 - 0x718      */
  volatile uint32_t type2_compare_3_word_0;       /*      0x718 - 0x71c      */
  volatile uint32_t type2_compare_3_word_1;       /*      0x71c - 0x720      */
  volatile uint32_t type2_compare_4_word_0;       /*      0x720 - 0x724      */
  volatile uint32_t type2_compare_4_word_1;       /*      0x724 - 0x728      */
  volatile uint32_t type2_compare_5_word_0;       /*      0x728 - 0x72c      */
  volatile uint32_t type2_compare_5_word_1;       /*      0x72c - 0x730      */
  volatile uint32_t type2_compare_6_word_0;       /*      0x730 - 0x734      */
  volatile uint32_t type2_compare_6_word_1;       /*      0x734 - 0x738      */
  volatile uint32_t type2_compare_7_word_0;       /*      0x738 - 0x73c      */
  volatile uint32_t type2_compare_7_word_1;       /*      0x73c - 0x740      */
  volatile uint32_t type2_compare_8_word_0;       /*      0x740 - 0x744      */
  volatile uint32_t type2_compare_8_word_1;       /*      0x744 - 0x748      */
  volatile uint32_t type2_compare_9_word_0;       /*      0x748 - 0x74c      */
  volatile uint32_t type2_compare_9_word_1;       /*      0x74c - 0x750      */
  volatile uint32_t type2_compare_10_word_0;      /*      0x750 - 0x754      */
  volatile uint32_t type2_compare_10_word_1;      /*      0x754 - 0x758      */
  volatile uint32_t type2_compare_11_word_0;      /*      0x758 - 0x75c      */
  volatile uint32_t type2_compare_11_word_1;      /*      0x75c - 0x760      */
  volatile uint32_t type2_compare_12_word_0;      /*      0x760 - 0x764      */
  volatile uint32_t type2_compare_12_word_1;      /*      0x764 - 0x768      */
  volatile uint32_t type2_compare_13_word_0;      /*      0x768 - 0x76c      */
  volatile uint32_t type2_compare_13_word_1;      /*      0x76c - 0x770      */
  volatile uint32_t type2_compare_14_word_0;      /*      0x770 - 0x774      */
  volatile uint32_t type2_compare_14_word_1;      /*      0x774 - 0x778      */
  volatile uint32_t type2_compare_15_word_0;      /*      0x778 - 0x77c      */
  volatile uint32_t type2_compare_15_word_1;      /*      0x77c - 0x780      */
  volatile uint32_t type2_compare_16_word_0;      /*      0x780 - 0x784      */
  volatile uint32_t type2_compare_16_word_1;      /*      0x784 - 0x788      */
  volatile uint32_t type2_compare_17_word_0;      /*      0x788 - 0x78c      */
  volatile uint32_t type2_compare_17_word_1;      /*      0x78c - 0x790      */
  volatile uint32_t type2_compare_18_word_0;      /*      0x790 - 0x794      */
  volatile uint32_t type2_compare_18_word_1;      /*      0x794 - 0x798      */
  volatile uint32_t type2_compare_19_word_0;      /*      0x798 - 0x79c      */
  volatile uint32_t type2_compare_19_word_1;      /*      0x79c - 0x7a0      */
  volatile uint32_t type2_compare_20_word_0;      /*      0x7a0 - 0x7a4      */
  volatile uint32_t type2_compare_20_word_1;      /*      0x7a4 - 0x7a8      */
  volatile uint32_t type2_compare_21_word_0;      /*      0x7a8 - 0x7ac      */
  volatile uint32_t type2_compare_21_word_1;      /*      0x7ac - 0x7b0      */
  volatile uint32_t type2_compare_22_word_0;      /*      0x7b0 - 0x7b4      */
  volatile uint32_t type2_compare_22_word_1;      /*      0x7b4 - 0x7b8      */
  volatile uint32_t type2_compare_23_word_0;      /*      0x7b8 - 0x7bc      */
  volatile uint32_t type2_compare_23_word_1;      /*      0x7bc - 0x7c0      */
  volatile uint32_t type2_compare_24_word_0;      /*      0x7c0 - 0x7c4      */
  volatile uint32_t type2_compare_24_word_1;      /*      0x7c4 - 0x7c8      */
  volatile uint32_t type2_compare_25_word_0;      /*      0x7c8 - 0x7cc      */
  volatile uint32_t type2_compare_25_word_1;      /*      0x7cc - 0x7d0      */
  volatile uint32_t type2_compare_26_word_0;      /*      0x7d0 - 0x7d4      */
  volatile uint32_t type2_compare_26_word_1;      /*      0x7d4 - 0x7d8      */
  volatile uint32_t type2_compare_27_word_0;      /*      0x7d8 - 0x7dc      */
  volatile uint32_t type2_compare_27_word_1;      /*      0x7dc - 0x7e0      */
  volatile uint32_t type2_compare_28_word_0;      /*      0x7e0 - 0x7e4      */
  volatile uint32_t type2_compare_28_word_1;      /*      0x7e4 - 0x7e8      */
  volatile uint32_t type2_compare_29_word_0;      /*      0x7e8 - 0x7ec      */
  volatile uint32_t type2_compare_29_word_1;      /*      0x7ec - 0x7f0      */
  volatile uint32_t type2_compare_30_word_0;      /*      0x7f0 - 0x7f4      */
  volatile uint32_t type2_compare_30_word_1;      /*      0x7f4 - 0x7f8      */
  volatile uint32_t type2_compare_31_word_0;      /*      0x7f8 - 0x7fc      */
  volatile uint32_t type2_compare_31_word_1;      /*      0x7fc - 0x800      */
  volatile uint32_t enst_start_time_q8;           /*      0x800 - 0x804      */
  volatile uint32_t enst_start_time_q9;           /*      0x804 - 0x808      */
  volatile uint32_t enst_start_time_q10;          /*      0x808 - 0x80c      */
  volatile uint32_t enst_start_time_q11;          /*      0x80c - 0x810      */
  volatile uint32_t enst_start_time_q12;          /*      0x810 - 0x814      */
  volatile uint32_t enst_start_time_q13;          /*      0x814 - 0x818      */
  volatile uint32_t enst_start_time_q14;          /*      0x818 - 0x81c      */
  volatile uint32_t enst_start_time_q15;          /*      0x81c - 0x820      */
  volatile uint32_t enst_on_time_q8;              /*      0x820 - 0x824      */
  volatile uint32_t enst_on_time_q9;              /*      0x824 - 0x828      */
  volatile uint32_t enst_on_time_q10;             /*      0x828 - 0x82c      */
  volatile uint32_t enst_on_time_q11;             /*      0x82c - 0x830      */
  volatile uint32_t enst_on_time_q12;             /*      0x830 - 0x834      */
  volatile uint32_t enst_on_time_q13;             /*      0x834 - 0x838      */
  volatile uint32_t enst_on_time_q14;             /*      0x838 - 0x83c      */
  volatile uint32_t enst_on_time_q15;             /*      0x83c - 0x840      */
  volatile uint32_t enst_off_time_q8;             /*      0x840 - 0x844      */
  volatile uint32_t enst_off_time_q9;             /*      0x844 - 0x848      */
  volatile uint32_t enst_off_time_q10;            /*      0x848 - 0x84c      */
  volatile uint32_t enst_off_time_q11;            /*      0x84c - 0x850      */
  volatile uint32_t enst_off_time_q12;            /*      0x850 - 0x854      */
  volatile uint32_t enst_off_time_q13;            /*      0x854 - 0x858      */
  volatile uint32_t enst_off_time_q14;            /*      0x858 - 0x85c      */
  volatile uint32_t enst_off_time_q15;            /*      0x85c - 0x860      */
  volatile char pad__18[0x20];                    /*      0x860 - 0x880      */
  volatile uint32_t enst_control;                 /*      0x880 - 0x884      */
};

#endif /* __REG_EMAC_REGS__ */

#endif /* __REG_EMAC_REGS_H__ */
